--预设配置
AutoLoadPetTeamConfig = {
  enable = true, --是否启用
  modeName = {"混合", "练宠", "练级"}, --模式名称，只是改文字描述，实际作用不会变，练级模式只会加载有升级位的队伍
  mode = 1, --当前模式，对应上面的 1 ，2 ，3
  showTeamMessage = true, --显示换队信息
  loadAfterBattle = 0.04, --战斗后加载队伍，设置为-1时关闭,其他值为延时时间(秒)
  loadRetries = 50, --有可用队伍但加载失败时，重试次数
  loadRetryInteval = 0.004, --加载重试间隔(秒)
  showTeamCount = {true, true, true}, --1 显示在两次复活间的换队次数,只能技能cd时计数,2 全局计数 3 队伍全局计数
  enableBattleTimer = true, --战斗时间计时，同时统计纯战斗时间和战斗间隔
  enableXpLog = true, --经验获取计算，预估升级时间
  logToFile = false, --记录部分日志到文件，通过插件机制记录到WTF\Account\账号名\SavedVariables\zAutoLoadPetTeam_Rematch.lua中，每次进游戏会清空
  defaultTeam = {"三伊奇"}, --未找到预设队伍时的默认队伍
  alternates = {"锯齿迅猛龙"}, --练级队列为空时，替补练级宠位置，可多只，逗号分割，机械宠一只就够了
  --useRematchLoadingDone = false,--是否Rematch的加载完成时间
  --disableLoadSamePet = false,--禁用加载相同宠物替补
  petGroups = {
    ["自爆"] = {
      {"德莱尼微型防御者", 1, 2, 1, "1"}, --宠物名称，技能1(序号，1和2)，技能2，技能3，特殊标记
      {"挖洞蛛", 2, 1, 1},
      {"明亮孢子", 1, 1, 2},
      {"暗月飞艇", 1, 2, 1},
      {"机械熊猫人幼龙", 1, 2, 1},
      {"步行炸弹", 1, 2, 2},
      {"虚空深渊魔", 1, 2, 1},
      {"迷你地狱火", 1, 2, 2},
      {"迷你战争机器", 1, 1, 2},
      {"钢铁星弹", 2, 2, 2}
    },
    ["嚎叫"] = {
      {"霜狼幼崽", 1, 2, 1},
      {"高山幼狐", 2, 2, 1},
      {"小坏狼", 1, 1, 1},
      {"幼狐", 1, 2, 1},
      {"托托", 1, 2, 1},
      {"咬咬", 1, 1, 1},
      {"月月", 1, 1, 1},
      {"极地狐狸崽", 2, 2, 2},
      {"迷路的虚空狼崽", 2, 2, 2},
      {"邪能幼崽", 1, 1, 1},
      {"黑脚狐幼崽", 1, 2, 2}
    }
  }, --自定义宠物组,可将整组用于队伍替补
  debug = false --调试模式，会显示完整队列信息
}

AutoLoadPetTeamData = {
  --[[
   
  队伍配置说明
  [99182] = {}, 最基本的格式，默认直接使用Rematch对应该目标的队伍，多个队伍时按队伍显示顺序（即按名字排序后的..）
  [99182] = {teams={"自杀","自爆"}}, 使用自己定义的队伍列表

  [99182] = { 
    healthCheck ={ 
      {80,100,100}, --队伍1
      {50,50,50}  --队伍2
    } 
  }, 为指定队伍设定检查血线（百分比），不用全写，默认都是{100,100,100}，但要对应队伍顺序和宠物顺序( 检查{} )

  [99182] = {
    ignoreBreed={
      {true,true,true}, --队伍1
      {false,true,false}  --队伍2
    }
  } 替补时忽略属性匹配，针对队伍设置，默认都是要求完全匹配的，不用全写，注意对应队伍顺序


  [99182] = { 
    groups={ 
      { 
        {
          name="自爆",
          hp={1000,3000},
          speed={0,279},
          attack={100,500},
          tag="1"
        }, --宠物1
        {
          name="自爆",
          hp={1000,3000},
          speed={280,500},
          attack={100,500},
          tag="1"
        } --宠物2
      },--队伍1
      {}
    } 
  } 
  --对指定队伍的指定位置宠物设置替补宠物组，可根据血量，速度，攻击,标记进行筛选 格式为  attack={下限,上限}
  --上面这个就是1号位使用速度小于279的自爆宠物，2号位使用速度大于280的自爆宠物

  [107489] = {
    healthCheck = {
      {1, 100, 1},
      {1, 100, 1},
      {1, 100, 1}
    }
  }, --阿玛利亚★
  [99182] = {ignoreBreed = {true, false}}, --加尔维斯顿先生★

  [105386] = {
    groups={ 
      { 
        {
          name="嚎叫",
          speed={281,999}
        }, --宠物1
        {
          name="嚎叫",
          speed={281,999}
        } --宠物2
      } 
    } 
  }, --瑞迪尔★


]]
  --NPC数据可以从Npcs.lua文件中查找，把需要的拷贝到这里进行配置
  ------------------------------------------
  --[99182] = {},
  ------------------------------------------
  --占个位置
  [0] = {}
}
